app/Controllers/Home.php

SELECT *
FROM `tb_users`
---
    public function index()
    {
        if ($this->request->is('post')) {
            $model = model(UserModel::class);
            $user = $this->request->getPost();
            if ($user['id'] == null) {
                $model -> save($user);
            } else {
                $model -> update($user['id'], $user);
            }
        }
        $model = model(UserModel::class);
        $allUsers = $model->findAll();

SELECT *
FROM `tb_users`
WHERE `tb_users`.`id` = '2'
SELECT *
FROM `tb_users`
---
    public function updateUser($id){
        $model = model(UserModel::class);
        $user = $model->find($id);
        $allUsers = $model->findAll();

DELETE FROM `tb_users`
WHERE `id` IN ('2')
SELECT *
FROM `tb_users`
---
    public function deleteUser($id){
        $model = model(UserModel::class);
        $model->delete($id);
        $allUsers = $model->findAll();